; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v5 - type_1 ?v2 - type_3)
 	      (pred_1 ?v3 - object ?v2 - type_3)
	      (pred_2 ?v5 - type_1 ?v4 - type_2)
	      (pred_3 ?v5 - type_1 ?v3 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v5 - type_1 ?v1 ?v7 - type_3)
       :precondition (and  (pred_4 ?v5 ?v1))
       :effect (and  (pred_4 ?v5 ?v7)
		     (not (pred_4 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_1 ?v6 - object ?v8 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v8) (pred_4 ?v5 ?v8) (pred_2 ?v5 ?v4))
       :effect (and (pred_3 ?v5 ?v6 ?v4)
		    (not (pred_1 ?v6 ?v8)) 
		    (not (pred_2 ?v5 ?v4))))

   (:action op_1
       :parameters (?v5 - type_1 ?v6 - object ?v8 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v6 ?v4) (pred_4 ?v5 ?v8))
       :effect (and (pred_1 ?v6 ?v8)
		    (pred_2 ?v5 ?v4)
		    (not (pred_3 ?v5 ?v6 ?v4)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_01 - type_1
obj_07 obj_06 - type_2
obj_04 obj_02 obj_09 - type_3
obj_03 obj_05 obj_08 - object)
(:init
(pred_4 obj_01 obj_02)
(pred_2 obj_01 obj_07)
(pred_2 obj_01 obj_06)
(pred_1 obj_03 obj_02)
(pred_1 obj_05 obj_02)
(pred_1 obj_08 obj_04)
)
(:goal
(and
(pred_1 obj_03 obj_04)
(pred_1 obj_05 obj_02)
(pred_1 obj_08 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_01 ?b obj_07))))
)
)

; plan
1. (op_2 obj_01 obj_03 obj_02 obj_06)
   deleted: (pred_1 obj_03 obj_02) (pred_2 obj_01 obj_06)
   added: (pred_3 obj_01 obj_03 obj_06)
   goals met: 1 of 3
2. (op_3 obj_01 obj_02 obj_04)
   deleted: (pred_4 obj_01 obj_02)
   added: (pred_4 obj_01 obj_04)
   goals met: 1 of 3
3. (op_1 obj_01 obj_03 obj_04 obj_06)
   deleted: (pred_3 obj_01 obj_03 obj_06)
   added: (pred_1 obj_03 obj_04) (pred_2 obj_01 obj_06)
   goals met: 2 of 3
4. (op_2 obj_01 obj_08 obj_04 obj_06)
   deleted: (pred_1 obj_08 obj_04) (pred_2 obj_01 obj_06)
   added: (pred_3 obj_01 obj_08 obj_06)
   goals met: 2 of 3
5. (op_3 obj_01 obj_04 obj_02)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_02)
   goals met: 2 of 3
6. (op_1 obj_01 obj_08 obj_02 obj_06)
   deleted: (pred_3 obj_01 obj_08 obj_06)
   added: (pred_1 obj_08 obj_02) (pred_2 obj_01 obj_06)
   goals met: 3 of 3
